Repository: Pikkupomo/shuup-mailchimp
Catalog: shuup_mailchimp/locale/*/LC_MESSAGES/django.po
Languages: fi_fi

source: Mailchimp API key
fi_fi: Mailchimp API avain

source: Mailchimp list id
fi_fi: Mailchimp listan tunniste

source: Enabled
fi_fi: Käytössä

source: Mailchimp username
fi_fi: Mailchimp käyttäjänimi

source: Testing configuration failed
fi_fi: Asetusten testaaminen epäonnistui

source: Configuration test successful
fi_fi: Asetusten testaaminen onnistui

source: shop
fi_fi: kauppa

source: updated
fi_fi: päivitetty

source: created
fi_fi: luotu

source: sent to mailchimp
fi_fi: lähetetty mailchimpiin

source: contact
fi_fi: kontakti

source: email
fi_fi: sähköposti

source: Subscribe Newsletter
fi_fi: Tilaa uutiskirje

source: Title
fi_fi: Otsikko

source: Lead text
fi_fi: Ingressi

source: Link title
fi_fi: Linkin otsikko

source: Input placeholder text
fi_fi: Kentän näyttöteksti

source: Success message
fi_fi: Onnistumisviesti

source: Error message
fi_fi: Virheviesti

source: To enable your integration with Mailchimp, please create a Mailchimp list in your Mailchimp admin panel and link it to Shuup. The List ID can be found under "Settings->List name and defaults" in the Mailchimp admin panel.
fi_fi: Käyttääksesi Mailchimp integraatiota, ole hyvä ja luo Mailchimp lista Mailchimpin hallintapaneelissa ja linkitä se Shuupiin. Listan ID:n löydät "Settings->Listasi nimi ja defaults" Mailchimp hallintapaneelista.

source: The second step is to generate an API key for the integration in your Mailchimp admin panel and add it to the form below. API key generation can be found under "Account->Extras->API keys" in the Mailchimp admin panel.
fi_fi: Toinen askel on luoda API-avain integraatiollesi Mailchimp hallintapaneelissa ja lisätä se allaolevaan kenttään API-avaimen voit luoda Mailchimp hallintapaneelissa kohdassa "Account->Extras->API keys"

source: When you have all the configurations saved test your integration and enable it.
fi_fi: Kun kaikki konfiguraatiot on tallennettu ja testattu, voit ottaa integraation käyttöön.

source: Test configurations
fi_fi: Testaa konfiguraatiot

source: Please save configuration keys before testing.
fi_fi: Ole hyvä ja tallenna konfiguraatiotiedot ennen testausta.

source: Unexpected error happened please try again.
fi_fi: Tuntematon virhe, yritä uudelleen.
